#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```terraform

google_compute_global_address.default: Refreshing state... [id=projects/cloudresume-380001/global/addresses/resume]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_compute_backend_bucket.default will be created
  + resource "google_compute_backend_bucket" "default" {
      + bucket_name        = "davidbour-cloud-resume"
      + creation_timestamp = (known after apply)
      + description        = "cloud resume backend"
      + enable_cdn         = true
      + id                 = (known after apply)
      + name               = "cloud-resume-backend-bucket"
      + project            = (known after apply)
      + self_link          = (known after apply)

      + cdn_policy {
          + cache_mode        = "CACHE_ALL_STATIC"
          + client_ttl        = 3600
          + default_ttl       = 3600
          + max_ttl           = 86400
          + negative_caching  = true
          + serve_while_stale = 86400
        }
    }

  # google_compute_global_forwarding_rule.default will be created
  + resource "google_compute_global_forwarding_rule" "default" {
      + id                    = (known after apply)
      + ip_address            = "projects/cloudresume-380001/global/addresses/resume"
      + ip_protocol           = "TCP"
      + label_fingerprint     = (known after apply)
      + load_balancing_scheme = "EXTERNAL"
      + name                  = "http-lb-forwarding-rule"
      + network               = (known after apply)
      + port_range            = "80"
      + project               = (known after apply)
      + psc_connection_id     = (known after apply)
      + psc_connection_status = (known after apply)
      + self_link             = (known after apply)
      + target                = (known after apply)
    }

  # google_compute_managed_ssl_certificate.default will be created
  + resource "google_compute_managed_ssl_certificate" "default" {
      + certificate_id            = (known after apply)
      + creation_timestamp        = (known after apply)
      + expire_time               = (known after apply)
      + id                        = (known after apply)
      + name                      = "cloud-resume-cert"
      + project                   = (known after apply)
      + self_link                 = (known after apply)
      + subject_alternative_names = (known after apply)
      + type                      = "MANAGED"

      + managed {
          + domains = [
              + "davidbour.com",
            ]
        }
    }

  # google_compute_target_https_proxy.default will be created
  + resource "google_compute_target_https_proxy" "default" {
      + creation_timestamp = (known after apply)
      + id                 = (known after apply)
      + name               = "cloud-https-proxy"
      + project            = (known after apply)
      + proxy_bind         = (known after apply)
      + proxy_id           = (known after apply)
      + quic_override      = "NONE"
      + self_link          = (known after apply)
      + ssl_certificates   = (known after apply)
      + url_map            = (known after apply)
    }

  # google_compute_url_map.default will be created
  + resource "google_compute_url_map" "default" {
      + creation_timestamp = (known after apply)
      + default_service    = (known after apply)
      + fingerprint        = (known after apply)
      + id                 = (known after apply)
      + map_id             = (known after apply)
      + name               = "http-lb"
      + project            = (known after apply)
      + self_link          = (known after apply)
    }

  # google_storage_bucket.default will be created
  + resource "google_storage_bucket" "default" {
      + force_destroy               = true
      + id                          = (known after apply)
      + location                    = "US-EAST1"
      + name                        = "davidbour-cloud-resume"
      + project                     = (known after apply)
      + public_access_prevention    = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + uniform_bucket_level_access = true
      + url                         = (known after apply)

      + website {
          + main_page_suffix = "index.html"
          + not_found_page   = "404.html"
        }
    }

  # google_storage_bucket_iam_member.default will be created
  + resource "google_storage_bucket_iam_member" "default" {
      + bucket = "davidbour-cloud-resume"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = "allUsers"
      + role   = "roles/storage.objectViewer"
    }

Plan: 7 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pushed by: @david-bour, Action: `pull_request`*